# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'

# Binaries
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gist'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'tree' # List directories in a tree structure
brew 'zsh'
brew 'nano'
brew 'nvm'
brew 'weget'

# Spatie Medialibrary
cask 'imageoptim'
brew 'jpegoptim'
brew 'pngquant'
brew 'svgo'

# Apps
cask '1password'
cask '1password-cli'
cask 'appcleaner'
# cask 'aerial'
cask 'caffeine'
cask 'figma'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iina'
# cask 'insomnia'
cask 'postman'
cask 'rectangle'
cask 'signal'
# cask 'pastebot'
# cask 'ray'
# cask 'screenflow'
cask 'soundsource'
cask 'spotify'
cask 'sublime-text'
cask 'slack'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'quicknfo'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-caskaydia-cove-nerd-font'
cask 'font-fira-code-nerd-font'

# Mac App Store
mas 'Amphetamine', id: 937984704
mas 'Fantastical', id: 975937182
mas 'iStat Menus', id: 1319778037
mas 'OneDrive', id: 823766827
mas 'Slack', id: 803453959
mas 'Xcode', id: 497799835
