# Taps
tap "homebrew/autoupdate"
tap "homebrew/services"
tap "shaunsingh/sfmono-nerd-font-ligaturized"

# Binaries
brew 'antidote'
brew 'baobab'
brew 'btop'
brew 'coreutils'
brew 'curl'
brew 'ffmpeg'
brew 'fnm'
brew 'gh'
brew 'gist'
brew 'git-lfs'
brew 'git'
brew 'huggingface-cli'
brew 'jpegoptim'
brew 'jq'
brew 'mas'
brew 'micro'
brew 'nano'
brew 'optipng'
brew 'oxipng'
brew 'pipx'
brew 'pkgconf'
brew 'pngquant'
brew 'python@3.10'
brew 'python@3.11'
brew 'python@3.13'
brew 'tmux'
brew 'wget'
brew 'zsh'

# Apps
brew "codex"
cask '1password-cli'
cask '1password'
cask 'altserver'
cask 'appcleaner'
cask 'asana'
cask 'bruno'
cask 'chatgpt'
cask 'claude'
cask 'cleanshot'
cask 'conductor'
cask 'cursor'
cask 'cyberghost-vpn'
cask 'figma'
cask 'firefox'
cask 'font-anonymous-pro'
cask 'font-cascadia-code-pl'
cask 'font-caskaydia-cove-nerd-font'
cask 'font-fira-code-nerd-font'
cask 'font-lato'
cask 'font-monaspace'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-sf-mono-nerd-font-ligaturized'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'ghostty'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'helium-browser'
cask 'hoppscotch'
cask 'iina'
cask 'imageoptim'
cask 'jordanbaird-ice'
cask 'keka'
cask 'legcord'
cask 'logi-options+'
cask 'maccy'
cask 'microsoft-teams'
cask 'obs'
cask 'orbstack'
cask 'parsec'
cask 'postgres-unofficial'
cask 'raycast'
cask 'rectangle'
cask 'rustdesk'
cask 'signal'
cask 'slack'
cask 'soundsource'
cask 'spotify'
cask 'yaak'
cask 'zoom'

# Fonts

# Mac App Store
mas 'Fantastical', id: 975937182
mas 'Harvest', id: 355395846
mas 'iStat Menus', id: 1319778037
mas 'Okta Verify', id: 490179405
mas 'OneDrive', id: 823766827
mas 'Pixelmator Pro', id: 1289583905
mas 'Slack', id: 803453959
mas 'Xcode', id: 497799835
