# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gist'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'tree' # List directories in a tree structure
brew 'zsh'
brew 'nano'
brew 'nvm'
brew 'weget'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'pngquant'
brew 'svgo'

# Apps
cask '1password'
cask 'alfred'
cask 'appcleaner'
cask 'authy'
cask 'barrier'
cask 'browserstacklocal'
cask 'bettertouchtool'
cask 'caffeine'
cask 'dash'
cask 'discord'
cask 'dozer'
cask 'droplr'
cask 'figma'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iina'
cask 'karabiner-elements'
cask 'onyx'
cask 'postman'
cask 'purevpn'
cask 'rectangle'
cask 'scroll-reverser'
cask 'signal'
cask 'soundsource'
cask 'spotify'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'quicknfo'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-caskaydia-cove-nerd-font'
cask 'font-fira-code-nerd-font'

# Mac App Store
mas 'Amphetamine', id: 937984704
mas 'CARROT Weather', id: 993487541
mas 'Deliveries', id: 924726344
mas 'Fantastical', id: 975937182
mas 'GIPHY CAPTURE', id: 668208984
mas 'GoodNotes', id: 1444383602
mas 'iStat Menus', id: 1319778037
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft OneNote', id: 784801555
mas 'Microsoft Word', id: 462054704
mas 'OneDrive', id: 823766827
mas 'SketchBook', id: 863486266
mas 'Slack', id: 803453959
mas 'Xcode', id: 497799835
